In [17]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
# ----------------------------------- 연습문제(data.frame)
# 1. 열 갯수와 행의 갯수가 각각 5개 이상
# 2. 열에는 정수, 문자열, 실수, 자료형 데이터 1개씩 포함

df = {
    '104': [34, 56, 74, 34],
    '451': [45.1, 51.4, 4.57, 34],
    '541': ['df', 'sd', 'ef', 'as'],
    '12': [34, 56, 74, 34],
}
columns = ['104','451','541','12']
index = ['워','라','벨','췍']
frame = pd.DataFrame(df,index=index, columns=columns)
print(frame)

   104    451 541  12
워   34  45.10  df  34
라   56  51.40  sd  56
벨   74   4.57  ef  74
췍   34  34.00  as  34

In [5]:

# ----------------------- 연습문제3 -------Series&dataframe---------------------------
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
print(df)

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [6]:
# 1. 수학점수를 Series로 나타내기
print(df['수학'])
print(type(df['수학']))

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
# 2. 국어, 영어 점수를 dataframe으로 나타내기
print(df[['국어','영어']])
print(type(df[['국어','영어']]))

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40
<class 'pandas.core.frame.DataFrame'>

In [8]:
# 3. 모든 학생들의 각 과목 평균 점수를 새로운 열로 추가
df['평균점수'] = (((df['국어']+df['영어']+df['수학'])/3)).round(2)
print(df)

    국어  영어  수학   평균점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [9]:
# 4. 방자의 영어 점수를 80점으로수정, 평균점수 다시 계산
eng = pd.DataFrame({'영어':[80]},index=['방자'])
df.update(eng)
df['평균점수'] = (((df['국어']+df['영어']+df['수학'])/3)).round(2)
print(df)

    국어    영어  수학   평균점수
춘향  80  90.0  90  86.67
몽룡  90  70.0  60  73.33
향단  70  60.0  80  70.00
방자  30  80.0  70  60.00

In [10]:
# 5. 춘향이의 점수를 dataframe으로 나타내기
print(df[:1])
print(type(df[:1]))

    국어    영어  수학   평균점수
춘향  80  90.0  90  86.67
<class 'pandas.core.frame.DataFrame'>

In [11]:

# 6. 향단이의 점수를 Series로 나타내기
print(df[2:3])

    국어    영어  수학  평균점수
향단  70  60.0  80  70.0

In [12]:

# --------------------------- 연습문제1(Series)
# 1. 임의의 두개의 시리즈객체 생성, 문자열 index가지기, 공통적으로 포함되지 않는 라벨
a = pd.Series([3,5,6,7], index = ['안녕','반가워','저리가','바보야'])
b = pd.Series([3,5,6,7], index = ['안녕','반가워','저리가','바보야'])
print(a)
# 2. 두 시리즈 객체를 이용해서 사칙연산 만들기
a - b

안녕     3
반가워    5
저리가    6
바보야    7
dtype: int64

안녕     0
반가워    0
저리가    0
바보야    0
dtype: int64

In [13]:

# -------------연습문제 1 ----------------------(loc,iloc)
# 1. 행과 열에 라벨을 가지는 5x5이상의 크기를 가지는 dataframe만들기
np.random.seed(34)
a = pd.DataFrame(np.random.randint(1, 30, size =(5, 5)),
                 index = ['a','b','c','d','e'],
                 columns=['A','B','C','D','E'])
print(a)

    A   B   C   D   E
a   2  27  11  10  23
b  22   5   4   6  12
c  11  15  19  26  25
d   7  22  23  21   6
e   1   6  21  20  20

In [14]:

# 2. 10가지 이상의 방법으로 행, 열 선택하기
print(a.A)
print(a.B > a.D)
print(a.loc['a',: ])
print(a.iloc[2:4,0:3])
print(a.loc[a.E < 20,['A','C']])
print(a.loc['a','B'])
print(a.iloc[0:4])
print(a.iloc[-1:])
print(a.E)

a     2
b    22
c    11
d     7
e     1
Name: A, dtype: int32
a     True
b    False
c    False
d     True
e    False
dtype: bool
A     2
B    27
C    11
D    10
E    23
Name: a, dtype: int32
    A   B   C
c  11  15  19
d   7  22  23
    A   C
b  22   4
d   7  23
27
    A   B   C   D   E
a   2  27  11  10  23
b  22   5   4   6  12
c  11  15  19  26  25
d   7  22  23  21   6
   A  B   C   D   E
e  1  6  21  20  20
a    23
b    12
c    25
d     6
e    20
Name: E, dtype: int32

In [18]:
# ---------------------------------- 연습문제 4.2.5
# 타이타닉호 승객데이터의 데이터 값을 각 열마다 구해본다.
titanic = sns.load_dataset("titanic")
print(titanic.count)

<bound method DataFrame.count of      survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
0           0       3    male  22.0      1      0    7.2500        S   Third
1           1       1  female  38.0      1      0   71.2833        C   First
2           1       3  female  26.0      0      0    7.9250        S   Third
3           1       1  female  35.0      1      0   53.1000        S   First
4           0       3    male  35.0      0      0    8.0500        S   Third
5           0       3    male   NaN      0      0    8.4583        Q   Third
6           0       1    male  54.0      0      0   51.8625        S   First
7           0       3    male   2.0      3      1   21.0750        S   Third
8           1       3  female  27.0      0      2   11.1333        S   Third
9           1       2  female  14.0      1      0   30.0708        C  Second
10          1       3  female   4.0      1      1   16.7000        S   Third
11          1       1  female  58.0      0      0   26.5500        S   First
12          0       3    male  20.0      0      0    8.0500        S   Third
13          0       3    male  39.0      1      5   31.2750        S   Third
14          0       3  female  14.0      0      0    7.8542        S   Third
15          1       2  female  55.0      0      0   16.0000        S  Second
16          0       3    male   2.0      4      1   29.1250        Q   Third
17          1       2    male   NaN      0      0   13.0000        S  Second
18          0       3  female  31.0      1      0   18.0000        S   Third
19          1       3  female   NaN      0      0    7.2250        C   Third
20          0       2    male  35.0      0      0   26.0000        S  Second
21          1       2    male  34.0      0      0   13.0000        S  Second
22          1       3  female  15.0      0      0    8.0292        Q   Third
23          1       1    male  28.0      0      0   35.5000        S   First
24          0       3  female   8.0      3      1   21.0750        S   Third
25          1       3  female  38.0      1      5   31.3875        S   Third
26          0       3    male   NaN      0      0    7.2250        C   Third
27          0       1    male  19.0      3      2  263.0000        S   First
28          1       3  female   NaN      0      0    7.8792        Q   Third
29          0       3    male   NaN      0      0    7.8958        S   Third
..        ...     ...     ...   ...    ...    ...       ...      ...     ...
861         0       2    male  21.0      1      0   11.5000        S  Second
862         1       1  female  48.0      0      0   25.9292        S   First
863         0       3  female   NaN      8      2   69.5500        S   Third
864         0       2    male  24.0      0      0   13.0000        S  Second
865         1       2  female  42.0      0      0   13.0000        S  Second
866         1       2  female  27.0      1      0   13.8583        C  Second
867         0       1    male  31.0      0      0   50.4958        S   First
868         0       3    male   NaN      0      0    9.5000        S   Third
869         1       3    male   4.0      1      1   11.1333        S   Third
870         0       3    male  26.0      0      0    7.8958        S   Third
871         1       1  female  47.0      1      1   52.5542        S   First
872         0       1    male  33.0      0      0    5.0000        S   First
873         0       3    male  47.0      0      0    9.0000        S   Third
874         1       2  female  28.0      1      0   24.0000        C  Second
875         1       3  female  15.0      0      0    7.2250        C   Third
876         0       3    male  20.0      0      0    9.8458        S   Third
877         0       3    male  19.0      0      0    7.8958        S   Third
878         0       3    male   NaN      0      0    7.8958        S   Third
879         1       1  female  56.0      0      1   83.1583        C   First
880         1       2  female  25.0      0      1   26.0000        S  Second
881         0       3    male  33.0      0      0    7.8958        S   Third
882         0       3  female  22.0      0      0   10.5167        S   Third
883         0       2    male  28.0      0      0   10.5000        S  Second
884         0       3    male  25.0      0      0    7.0500        S   Third
885         0       3  female  39.0      0      5   29.1250        Q   Third
886         0       2    male  27.0      0      0   13.0000        S  Second
887         1       1  female  19.0      0      0   30.0000        S   First
888         0       3  female   NaN      1      2   23.4500        S   Third
889         1       1    male  26.0      0      0   30.0000        C   First
890         0       3    male  32.0      0      0    7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
5      man        True  NaN   Queenstown    no   True
6      man        True    E  Southampton    no   True
7    child       False  NaN  Southampton    no  False
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
10   child       False    G  Southampton   yes  False
11   woman       False    C  Southampton   yes   True
12     man        True  NaN  Southampton    no   True
13     man        True  NaN  Southampton    no  False
14   child       False  NaN  Southampton    no   True
15   woman       False  NaN  Southampton   yes   True
16   child       False  NaN   Queenstown    no  False
17     man        True  NaN  Southampton   yes   True
18   woman       False  NaN  Southampton    no  False
19   woman       False  NaN    Cherbourg   yes   True
20     man        True  NaN  Southampton    no   True
21     man        True    D  Southampton   yes   True
22   child       False  NaN   Queenstown   yes   True
23     man        True    A  Southampton   yes   True
24   child       False  NaN  Southampton    no  False
25   woman       False  NaN  Southampton   yes  False
26     man        True  NaN    Cherbourg    no   True
27     man        True    C  Southampton    no  False
28   woman       False  NaN   Queenstown   yes   True
29     man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
861    man        True  NaN  Southampton    no  False
862  woman       False    D  Southampton   yes   True
863  woman       False  NaN  Southampton    no  False
864    man        True  NaN  Southampton    no   True
865  woman       False  NaN  Southampton   yes   True
866  woman       False  NaN    Cherbourg   yes  False
867    man        True    A  Southampton    no   True
868    man        True  NaN  Southampton    no   True
869  child       False  NaN  Southampton   yes  False
870    man        True  NaN  Southampton    no   True
871  woman       False    D  Southampton   yes  False
872    man        True    B  Southampton    no   True
873    man        True  NaN  Southampton    no   True
874  woman       False  NaN    Cherbourg   yes  False
875  child       False  NaN    Cherbourg   yes   True
876    man        True  NaN  Southampton    no   True
877    man        True  NaN  Southampton    no   True
878    man        True  NaN  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
880  woman       False  NaN  Southampton   yes  False
881    man        True  NaN  Southampton    no   True
882  woman       False  NaN  Southampton    no   True
883    man        True  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [21]:

# ---------------------------------- 연습문제 4.2.6
# sex, age, class, alive 인원수 구하기
print(titanic['sex'].value_counts())
print(titanic['age'].value_counts())
print(titanic['class'].value_counts())
print(titanic['alive'].value_counts())


# ---------------------------------- 연습문제 4.2.7
# 사망자와 생존자로 그룹 나누고 labels의 승객비율구하기
# 비율의 전체 합은 1 이 되어야 한다
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

male      577
female    314
Name: sex, dtype: int64
24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64
Third     491
First     216
Second    184
Name: class, dtype: int64
no     549
yes    342
Name: alive, dtype: int64

In [19]:

# ----------------------------------- 연습문제 1(인덱스 조작)

# 1. 5명의 국,영,수 점수 만들기, 학생이름 열 포함하지 않기,
# df_score1 명을 가진 DataFrame생성
# df_score1.index 명에 학생이름 지정 index생성
# reset_index 로 df_score1.index을 일반 데이터열로 바꾸어서 df_score2 만들기

np.random.seed(34)

df_score1 = pd.DataFrame(np.random.randint(50, 100, size =(5, 3)))
print(df_score1)

df_score1.index = ['하영','선우','용후','세영','희택']
df_score1.columns = ['국어','수학','영어']
print(df_score1)

df_score2 = df_score1.reset_index()
print(df_score2)

    0   1   2
0  83  92  91
1  71  54  85
2  55  61  92
3  64  79  68
4  79  75  79
    국어  수학  영어
하영  83  92  91
선우  71  54  85
용후  55  61  92
세영  64  79  68
희택  79  75  79
  index  국어  수학  영어
0    하영  83  92  91
1    선우  71  54  85
2    용후  55  61  92
3    세영  64  79  68
4    희택  79  75  79

In [20]:


# 2. df_score2 에 set_index로 학생이름 나타내는 인덱스 변경

df_score2 = df_score2.set_index('index')
print(df_score2)

       국어  수학  영어
index
하영     83  92  91
선우     71  54  85
용후     55  61  92
세영     64  79  68
희택     79  75  79